_posts/2018-11-08-dex热修复方案的介绍.html
---
date: 2018-11-08
tags: 
- Android
author: tiankai
layout: post
title: Dex热修复方案的介绍
excerpt: Android 热修复 dex
categories: 
- Android
---

<div id="outline-container-orge1c7775" class="outline-2">
<h2 id="orge1c7775">Dex 热修复方案的调研</h2>
<div class="outline-text-2" id="text-orge1c7775">
<p>
对 Dex 文件进行热修复，本质上就是对 Dex 文件中的类进行类修复。目前主流的针对 dex
文件的热修复方案有两种：底层替换方案和类加载方案。这两种方案各有千秋。
</p>
<ul class="org-ul">
<li><b>底层替换方案</b> ：时效性最好，实时生效，加载轻快，但是有很大的限制，如不能添加新
的方法。</li>
<li><b>类加载方案</b> ：修复的范围比较广，限制少，但是需要重新启动才能生效。</li>
</ul>
</div>
<div id="outline-container-orga29e64b" class="outline-3">
<h3 id="orga29e64b">底层替换方案的调研</h3>
<div class="outline-text-3" id="text-orga29e64b">
<p>
底层替换方案的原理：在 android 应用运行过程中，加载补丁包中需要修复的类的方法，
然后找到需要修复的原始类，将原始类中底层的关于方法的结构体（method 结构体）替换
成补丁包中的类的 method 结构体。
</p>

<p>
这种修复方案有一个难点是如何保证在不同的 android 版本以及不同的 ROM 厂商的
Android 版本下保证兼容性。这是因为不同的 android 版本甚至不同的 ROM 厂商发布的
Android 系统的底层的 method 结构是不同的，不同的底层结构就带来了底层数据结构替换
实现的困难。当然我们可以在编译阶段为每个系统做适配，指定每个系统相对应的 method
结构体的大小。这种方案在实现起来比较复杂，而且现实中国内很多 ROM 厂商的 method结
构体的大小是未知的。这就为该方案的兼容性带来比较大的难度。
</p>


<p>
这里采用阿里巴巴 Sophix 的方案。这种方案的核心思想就是使用两个相邻的桩函数，通过
计算这两个桩函数的 method 结构在内存中的地址的差值，将每个 method 结构体的大小计
算出来，得到 method 结构体的大小之后，就很容易机型替换了。
</p>

<p>
这里贴一小段关键的代码实现：
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">replaceMethod</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">JNIEnv</span>* <span style="color: #7590db;">env</span>, <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">clazz</span>, <span style="color: #ce537a; font-weight: bold;">jobject</span> <span style="color: #7590db;">olderMethodObject</span>,
                          <span style="color: #ce537a; font-weight: bold;">jobject</span> <span style="color: #7590db;">fixedMethodObject</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">get method size</span>
    <span style="color: #ce537a; font-weight: bold;">jclass</span> <span style="color: #7590db;">structModelClass</span> = env-&gt;FindClass<span style="color: #bc6ec5;">(</span>STRUCTMODELCLASSNAME<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold; font-style: italic;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">NULL</span> == structModelClass<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        EGIS_DEBUG<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"can not find %s"</span> , STRUCTMODELCLASSNAME<span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">firMid</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">size_t</span><span style="color: #bc6ec5;">)</span>env-&gt;GetStaticMethodID<span style="color: #bc6ec5;">(</span>structModelClass , <span style="color: #2d9574;">"function1"</span>, <span style="color: #2d9574;">"()V"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">secMid</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">size_t</span><span style="color: #bc6ec5;">)</span>env-&gt;GetStaticMethodID<span style="color: #bc6ec5;">(</span>structModelClass , <span style="color: #2d9574;">"function2"</span>, <span style="color: #2d9574;">"()V"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">size_t</span> <span style="color: #7590db;">methodSize</span> = secMid - firMid;
    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">get start id from src and dest</span>
    <span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">olderMethod</span> = <span style="color: #4f97d7; font-weight: bold; font-style: italic;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">void</span>*<span style="color: #bc6ec5;">&gt;(</span>env-&gt;FromReflectedMethod<span style="color: #2d9574;">(</span>olderMethodObject<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #ce537a; font-weight: bold;">void</span>* <span style="color: #7590db;">fixedMethod</span> = <span style="color: #4f97d7; font-weight: bold; font-style: italic;">reinterpret_cast</span><span style="color: #bc6ec5;">&lt;</span><span style="color: #ce537a; font-weight: bold;">void</span>*<span style="color: #bc6ec5;">&gt;(</span>env-&gt;FromReflectedMethod<span style="color: #2d9574;">(</span>fixedMethodObject<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    memcpy<span style="color: #bc6ec5;">(</span>olderMethod, fixedMethod, methodSize<span style="color: #bc6ec5;">)</span>;
</pre>
</div>

<p>
该方案的实现基本上已经讲清楚了，但是有一个关键的点需要说明一下：底层替换方案的有
很大的限制，这个限制主要指的是底层替换方案只能修复方案，不能处理添加方法的情况。
这是因为什么呢？其实原因很简单，我们进行底层替换需要找到需要修复的类中的方法的底
层 method 结构体，但是对于类中的方法增加的情况， 由于找不到需要替换的结构体，所
以这种方案就无法实现。如果遇到需要修复的类中有方法增加的情况，底层替换方案就不试
用了，此时需要使用类加载的方案进行热修复。
</p>
</div>
</div>
<div id="outline-container-org0609a21" class="outline-3">
<h3 id="org0609a21">类加载方案调研</h3>
<div class="outline-text-3" id="text-org0609a21">
<p>
类加载方案的原理：在 Android 应用程序重新启动后，让 classloader 去加载新的类（补
丁包中的类），因为在 app 运行到一半的时候，所有的需要修复的类都已经加载过了，在
Android 系统中是没有办法对一个类进行卸载的，如果不重启，原来的类还在虚拟机中，就
无法加载新的类。只有在下次重启的时候，在还没有走到正常的业务逻辑之前抢先加载补丁
中的新类，这样后续使用这个类时，就会使用新的类。
</p>

<p>
关于类加载的方案由于  Android 系统在 Dalvik 以及 ART 模式下的不同，造成了类加载
方案在具体实现上的不同。
</p>

<p>
<b>ART 模式下的实现</b> 
将补丁包命名为 classes.dex 文件，将原 APK 中的 dex 文件以此命名为 classes2.dex、
classes3.dex&#x2026;文件，然后将这些文件作为一个整体打包为一个  Jar 包。使用
DexFile.LoadDex得到 DexFile对象，然后将这个 DexFile 的对象整个替换就得
DexElements 数组就可以了。（关于这个数组的介绍，本文不再涉及，如果感兴趣可以自行
查阅资料）
</p>

<p>
<b>Dalvik 模式下的实现</b> 
对于 Android 下的类加载的方案，最早的实现方案是 QQ 空间提出的 dex 插入方案。该方
案的主要思想是把补丁 dex 文件插入到 ClassLoader 的索引路径的最签名，这样在 Load
一个 class 时，就会优先找到补丁中的 class。但是这类插入 Dex 文件的方案都会遇到一
个共同的问题：Dalvik 模式下的 pre-verified问题。
</p>

<p>
在  Dalvik 模式下的热修复方案是最复杂的，这是由于在 Dalvik 虚拟机中对类以及加载类的
ClassLoader进行了校验，简单来说，如果 B（原始的类，在原 dex 中） 调用了 A（修复
后的类，在补丁 dex 中），由于Android 系统的 dexopt 机制， B 类被打上了
/CLASS<sub>ISPREVERIFIED</sub>/标签，此时对 A 进行解析是就会触发异常，触发的异常如下所示：
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">referer: class B</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">resClassClassCheck: class A</span>
<span style="color: #4f97d7; font-weight: bold; font-style: italic;">if</span> <span style="color: #4f97d7;">(</span>referer-&gt;pDvmDex != resClassCheck-&gt;pDvmDex &amp;&amp;
    resClassCheck-&gt;classLoader != <span style="color: #a45bad;">NULL</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    dvmThrowIllegalAccessError<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Class ref in pre-verified class resolve to unexpected implementation"</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold; font-style: italic;">return</span> <span style="color: #a45bad;">NULL</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
为了解决上面的问题，不同的热修复的框架想了不同的办法，在这里介绍几个。
</p>
<ul class="org-ul">
<li>单独放一个类在一个独立的 dex 文件中，这个帮助类需要被其他类调用，阻止类被加上
CLASS<sub>ISPREVERIFIED</sub> 标签。然后加载补丁 dex 文件，得到 DexFile对象，使用得到的
DexFile 作为参数构造一个 DexElement 对象， <b>插入</b> 到原始的 dexElements 数组的前面。</li>
<li>使用补丁 Dex 文件和原始的 APK 中的文件进行重组，重组成一个 Jar 文件，然后使用
这个 Jar 包进行加载，得到 dexFile 对象，使用这个对象作为参数，构建 dexElements
数组，然后 <b>整体替换</b> 旧的 dexElements 数组。</li>
</ul>

<p>
本文主要介绍合成  jar 包文件的方式。这种方案的核心思想是获取到补丁 dex 文件中的
所有的类，然后通过二进制解析的方式对原始 APK 中的 dex 文件进行解析，在原始的 dex
文件中抹掉需要修复的类的 ClassDefs 结构，再讲补丁 dex 和修改后的原始 dex 文件组
合成一个 Jar 包。然后使用 DexFile.Load 对这个 Jar 包进行加载，构造 dexElements
结构体，然后替换掉原始的 dexElements 对象。
</p>
</div>
</div>

<div id="outline-container-org7405f89" class="outline-3">
<h3 id="org7405f89">关于类加载方案的另一种实现</h3>
<div class="outline-text-3" id="text-org7405f89">
<p>
在实际对类加载方案的实现过程中，发现了一种比较好的方案，这里会详细的讲一下。
</p>
</div>
</div>

<div id="outline-container-orgcc814d9" class="outline-3">
<h3 id="orgcc814d9">致谢</h3>
<div class="outline-text-3" id="text-orgcc814d9">
<p>
本文主要参考了阿里巴巴的《深入探索 Android 热修复技术原理》一书，在这里对这本书
的作者表示敬意。
</p>
</div>
</div>
</div>
